[
  {
    "url": "https://www.ndtv.com/india-news/asking-for-right-to-free-speech-where-is-your-duty-court-to-ashoka-professor-8468531",
    "title": "Ashoka University, Ali Khan Mahmudabad, Operation Sindoor: Asking For Right To Free Speech, Where Is Your Duty? Court To Ashoka Professor",
    "chunk": "Ashoka University, Ali Khan Mahmudabad, Operation Sindoor: Asking For Right To Free Speech, Where Is Your Duty? Court To Ashoka Professor arrow-down comments printer search bell top-nav right-arrow NDTV World Profit हिंदी MOVIES IPL 2025 FOOD LIFESTYLE HEALTH TECH Games Big Bonus SHOPPING APPS Rajasthan MPCG Marathi Advertisement Live TV Latest India India All India News India Global Diaspora South Latest Will IndiGo Curb Deal With Turkish Airlines After Op Sindoor? What CEO Said 'Near-Death Experience': Trinamool MPs' Team On IndiGo Plane Caught In Storm J&K Lt Governor Announces Government Job For Family Of Shelling Victims Chennai Cop Dies By Suicide Ahead Of Drunk Driving Inquiry Meitei Group Calls 48-Hr Strike Over 'Manipur' Signage Removal World Videos Opinion Cities Metros Bengaluru Chennai Delhi Mumbai Other Cities Ahmedabad Allahabad Amritsar Bhopal Bhubaneshwar Chandigarh Ghaziabad Goa Gurgaon Guwahati Hyderabad Jaipur Kanpur Kolkata Lucknow Noida Patna Pune Srinagar Thiruvananthapuram Auto Web Stories Education Education Exams School Campus Study Abroad Web Stories Latest Planning To Study In UK? Here's How To Apply For Right Visa Kerala Class 12 Result 2025 To Be Declared On May 22 At This Time Rajasthan Board Class 12 Result To Be Out On May 22 At 3pm, Check Details After Student Complaints, HPBOSE To Recheck Class 12 English Answer Sheets Maharashtra Class 11 Admission Registration Begins For 20 Lakh Seats Podcast Auto Lifestyle Entertainment Offbeat Web Stories Science Trends Photos Feature People TV Schedule India@AI Login Switch To Dark/Light Mode Trending Tags Latest News World News PNR Status Education News Business News Sports News MP",
    "chunk_id": "https://www.ndtv.com/india-news/asking-for-right-to-free-speech-where-is-your-duty-court-to-ashoka-professor-8468531_0",
    "timestamp": "2025-05-22T00:53:21.733186"
  },
  {
    "url": "https://www.ndtv.com/india-news/asking-for-right-to-free-speech-where-is-your-duty-court-to-ashoka-professor-8468531",
    "title": "Ashoka University, Ali Khan Mahmudabad, Operation Sindoor: Asking For Right To Free Speech, Where Is Your Duty? Court To Ashoka Professor",
    "chunk": "Begins For 20 Lakh Seats Podcast Auto Lifestyle Entertainment Offbeat Web Stories Science Trends Photos Feature People TV Schedule India@AI Login Switch To Dark/Light Mode Trending Tags Latest News World News PNR Status Education News Business News Sports News MP Chhattisgarh News Rajasthan News Latest Mobile Phones Trending Committed To Closer Ties With India, Says Justin Trudeau Amid Row In Avoiding Repeat Of Telangana, BJP Pays Price In Tamil Nadu Man Complains Of Stomach Pain For Years, Doctors Find This Inside His Body \"They Can Speak For...\": US On India's Response On Canada's Allegations Professor Arrested For Op Sindoor Post Gets Bail, \"Choice Of Words\" Lesson facebook twitter WhatsApp comments Settings Change Font Size A A Focus on Story Edition INDIA World Search here Get App for Better Experience Get it on Google Play Download on the App Store choose your destination Hindi Marathi MPCG Rajasthan News Updates Live TV India Latest Video Podcast Profit Movies News Updates Cricket Cities Notifications Opinion Web Stories Trends Featured Feature Offbeat Science People South Education Tech Food Sports Health Lifestyle Photos TV Schedule Big Bonus Toolbox Follow Us On Facebook Twitter Instagram LinkedIn YouTube search olympic crypto_icon News India News Professor Arrested For Op Sindoor Post Gets Bail, \"Choice Of Words\" Lesson Professor Arrested For Op Sindoor Post Gets Bail, \"Choice Of Words\" Lesson Professor Mahmudabad, associate professor and Head of the Department of Political Science at Ashoka University, was arrested last week over a social media post on Operation Sindoor Reported by: Ashish Bhargava Edited by: Saikat Kumar",
    "chunk_id": "https://www.ndtv.com/india-news/asking-for-right-to-free-speech-where-is-your-duty-court-to-ashoka-professor-8468531_1",
    "timestamp": "2025-05-22T00:53:25.062778"
  },
  {
    "url": "https://www.ndtv.com/india-news/asking-for-right-to-free-speech-where-is-your-duty-court-to-ashoka-professor-8468531",
    "title": "Ashoka University, Ali Khan Mahmudabad, Operation Sindoor: Asking For Right To Free Speech, Where Is Your Duty? Court To Ashoka Professor",
    "chunk": "Bail, \"Choice Of Words\" Lesson Professor Mahmudabad, associate professor and Head of the Department of Political Science at Ashoka University, was arrested last week over a social media post on Operation Sindoor Reported by: Ashish Bhargava Edited by: Saikat Kumar Bose India News May 21, 2025 14:06 pm IST Published On May 21, 2025 12:06 pm IST Last Updated On May 21, 2025 14:06 pm IST Read Time: 4 mins Share Twitter WhatsApp Facebook Reddit Email Professor Mahmudabad is Head of Department of Political Science at Ashoka University Quick Read Summary is AI generated, newsroom reviewed. The Supreme Court granted bail to Ashoka University professor Ali Khan Mahmudabad, but criticised his social media post on Operation Sindoor. The court stressed the importance of responsibility in exercising free speech. New Delhi: The Supreme Court today granted interim bail to Ashoka University professor Ali Khan Mahmudabad, but pulled him up for his social media post on Operation Sindoor. The court said \"monsters\" came and attacked our country and asked the professor why he needed to seek \"cheap popularity\". Professor Mahmudabad, associate professor and Head of the Department of Political Science at Ashoka University, was arrested last week over a social media post on Operation Sindoor. He was charged under sections linked to promoting enmity between groups and acts seen as threatening national integrity and sovereignty. Senior Advocate Kapil Sibal appeared before the bench of Justice Surya Kant and Justice N Kotiswar Singh today to argue Mr Mahmudabad's case. In response to the arguments, Justice Kant said, \"Yes, everyone",
    "chunk_id": "https://www.ndtv.com/india-news/asking-for-right-to-free-speech-where-is-your-duty-court-to-ashoka-professor-8468531_2",
    "timestamp": "2025-05-22T00:53:28.435606"
  },
  {
    "url": "https://www.ndtv.com/india-news/asking-for-right-to-free-speech-where-is-your-duty-court-to-ashoka-professor-8468531",
    "title": "Ashoka University, Ali Khan Mahmudabad, Operation Sindoor: Asking For Right To Free Speech, Where Is Your Duty? Court To Ashoka Professor",
    "chunk": "seen as threatening national integrity and sovereignty. Senior Advocate Kapil Sibal appeared before the bench of Justice Surya Kant and Justice N Kotiswar Singh today to argue Mr Mahmudabad's case. In response to the arguments, Justice Kant said, \"Yes, everyone has the right to free speech and expression... Is it the time to talk about all of this? The country is already going through all this... monsters came and attacked our people... we have to be united. Why (do this) to get cheap popularity on these occasions?\" Mr Sibal then stressed there was no criminal intent in the professor's social media post. Justice Kant replied, \"You should know what is happening. There is a right to free speech etc... where is the duty? As if the whole country for the last 75 years is only distributing rights and no duty.\" Justice Kant also said the professor's remarks are \"dogwhistling\". \"Very unfortunate for a society with free speech when choice of words is deliberately made to insult, humiliate and cause discomfort to the other side. He should not have lack of dictionary words to use. He can use language which does not hurt sentiments of others, use neutral language,\" the judge said. Mr Sibal pointed out that there is no criminal intent or attempt to generate communal tension on the part of the professor. \"He was just hurt. His wife is 9 months pregnant, but he is in jail. Now a second FIR by women commission. What did he say against women?\" The court noted that the",
    "chunk_id": "https://www.ndtv.com/india-news/asking-for-right-to-free-speech-where-is-your-duty-court-to-ashoka-professor-8468531_3",
    "timestamp": "2025-05-22T00:53:32.222407"
  },
  {
    "url": "https://www.ndtv.com/india-news/asking-for-right-to-free-speech-where-is-your-duty-court-to-ashoka-professor-8468531",
    "title": "Ashoka University, Ali Khan Mahmudabad, Operation Sindoor: Asking For Right To Free Speech, Where Is Your Duty? Court To Ashoka Professor",
    "chunk": "tension on the part of the professor. \"He was just hurt. His wife is 9 months pregnant, but he is in jail. Now a second FIR by women commission. What did he say against women?\" The court noted that the professor's remarks are \"anti-war\". \"He says that reasons are families will suffer along with civilians. He also speaks of countries that manufacture war equipment will benefit. Anyone who is conversant with such language can probe this... because some words have dual meanings,\" the bench said. The court, however, said no case of pausing the investigation is made out. \"However, to understand the complexity and for proper appreciation of the language used in the post, we direct DGP Haryana to constitute a SIT comprising three IPS officers who do not belong to Haryana or Delhi. SIT shall be headed by Inspector General of police and one of the members shall be a woman officer,\" it said. The court granted bail to the professor with three conditions: he will not write any article or online post or deliver any speech related to the case, he won't comment on the Pahalgam attack or Operation Sindoor and he will surrender his passport. The professor faces two FIRs, one of them filed by Renu Bhatia, chairperson of the Haryana State Commission for Women, for his remarks on the government's choice of Colonel Sofiya Qureshi and Wing Commander Vyomika Singh for Operation Sindoor briefings. Referring to Colonel Qureshi, the professor had said he was happy to see right-wing commentators applauding the Colonel.",
    "chunk_id": "https://www.ndtv.com/india-news/asking-for-right-to-free-speech-where-is-your-duty-court-to-ashoka-professor-8468531_4",
    "timestamp": "2025-05-22T00:53:35.875616"
  },
  {
    "url": "https://www.ndtv.com/india-news/asking-for-right-to-free-speech-where-is-your-duty-court-to-ashoka-professor-8468531",
    "title": "Ashoka University, Ali Khan Mahmudabad, Operation Sindoor: Asking For Right To Free Speech, Where Is Your Duty? Court To Ashoka Professor",
    "chunk": "for Women, for his remarks on the government's choice of Colonel Sofiya Qureshi and Wing Commander Vyomika Singh for Operation Sindoor briefings. Referring to Colonel Qureshi, the professor had said he was happy to see right-wing commentators applauding the Colonel. \"... but perhaps they could also equally loudly demand that the victims of mob lynchings, arbitrary bulldozing and others who are victims of the BJP's hate mongering be protected as Indian citizens. The optics of two women soldiers presenting their findings is important but optics must translate to reality on the ground otherwise it's just hypocrisy\". The women commission said a review of Mr Khan's remarks raises concerns about the \"disparagement of women in uniform, including Col Qureshi and Wing Commander Singh, and undermining their role as professional officers in the Indian Armed Forces\". The professor had said the women's panel \"misunderstood\" his remarks. \"...I am surprised that the Women's Commission, while overreaching its jurisdiction, has misread and misunderstood my posts to such an extent that they have inverted their meaning,\" he said. The Ashoka University administration has welcomed the top court ruling and said it was \"heartened\" and \"relieved\" that the professor got interim bail. \"We are relieved and heartened by Prof Ali Khan Mahmudabad being granted interim bail by the Hon'ble Supreme Court. It has provided great comfort to his family and all of us at Ashoka University,\" the university said in a statement. Show full article Track Latest News Live on NDTV.com and get news updates from India and around the world Follow",
    "chunk_id": "https://www.ndtv.com/india-news/asking-for-right-to-free-speech-where-is-your-duty-court-to-ashoka-professor-8468531_5",
    "timestamp": "2025-05-22T00:53:39.715660"
  },
  {
    "url": "https://www.ndtv.com/india-news/asking-for-right-to-free-speech-where-is-your-duty-court-to-ashoka-professor-8468531",
    "title": "Ashoka University, Ali Khan Mahmudabad, Operation Sindoor: Asking For Right To Free Speech, Where Is Your Duty? Court To Ashoka Professor",
    "chunk": "has provided great comfort to his family and all of us at Ashoka University,\" the university said in a statement. Show full article Track Latest News Live on NDTV.com and get news updates from India and around the world Follow us: Ashoka University Professor Arrested , Ali Khan Mahmudabad Arrest , Justice Surya Kant Related News Supreme Court To Hear Ashoka University Professor's Plea Against Arrest Over Post On Op Sindoor \"Mistake Is His Name\": Congress Compares Action Against Professor, Minister \"Reservation Like Train Compartment...\": Supreme Court Judge's Big Remark Trending News Video: Passengers Scream As IndiGo Flight Hit By Turbulence, Aircraft Damaged Sufism, Seduction, And Pak ISI: The Double Life Of Diplomat Madhuri Gupta Cannes 2025: Ishaan, Janhvi's Homebound Gets A Nine-Minute Standing Ovation As Trump Reveals 'Golden Dome', A Look At India's Shield, Israel's Iron Dome Thug Life : Trisha Reacts To Romancing Kamal Haasan Despite 30-Year Age Gap Advertisement Advertisement Advertisement Quick Links Latest News PNR Status Education News Business News Sports News MP Chhattisgarh News NDTV Profit Auto News AI News Sofiya Qureshi Remark Mumbai Rain Jyoti Malhotra Amit Malviya Kannada Language Row Operation Sindoor Maharashtra Covid Cases MI vs DC Advertisement Edition INDIA World Search for News, Photos and Videos Get App for Better Experience Get it on Google Play Download on the App Store Get App for Better Experience Install Now choose your destination Hindi Marathi MPCG Rajasthan News Updates Live TV India Latest Video Podcast Profit Movies Cricket Cities Featured Notifications Opinion Web Stories Trends Feature More Links Offbeat",
    "chunk_id": "https://www.ndtv.com/india-news/asking-for-right-to-free-speech-where-is-your-duty-court-to-ashoka-professor-8468531_6",
    "timestamp": "2025-05-22T00:53:43.442009"
  },
  {
    "url": "https://www.ndtv.com/india-news/asking-for-right-to-free-speech-where-is-your-duty-court-to-ashoka-professor-8468531",
    "title": "Ashoka University, Ali Khan Mahmudabad, Operation Sindoor: Asking For Right To Free Speech, Where Is Your Duty? Court To Ashoka Professor",
    "chunk": "on the App Store Get App for Better Experience Install Now choose your destination Hindi Marathi MPCG Rajasthan News Updates Live TV India Latest Video Podcast Profit Movies Cricket Cities Featured Notifications Opinion Web Stories Trends Feature More Links Offbeat Science People South Education Tech Food Sports Health Lifestyle Photos TV Schedule Big Bonus Toolbox Follow Us On Facebook Twitter Instagram Linkedin Youtube Whatsapp Threads Snapchat arrow-down search search olympic crypto_icon arrow-rgt arrow-next arrow-up close reddit-fill facebook-fill whatsapp-fill cog left-arrow snapchat-fill astrology-icn Listen to the latest songs , only on JioSaavn.com",
    "chunk_id": "https://www.ndtv.com/india-news/asking-for-right-to-free-speech-where-is-your-duty-court-to-ashoka-professor-8468531_7",
    "timestamp": "2025-05-22T00:53:46.191697"
  },
  {
    "url": "https://news.google.com/read/CBMisAFBVV95cUxPOC1lc29vaEt2cV9YVVFTOUFia0RXU21Rck5qblNaZThaOWpKNjhSUnJHbi1fTDNkUndNei11YzhlWDlkTkppT3Y4c0xtckZjTU4tMGhQUGFGdFVfUGlwNEZwTFNiYWxKZ0hZT2E4ZGJhZlNBUlNVUzhQZW1lWjM4cmtZYTJyYUtHTlE5ZV9IdXhGbzhXUFJRa1JTeEttWENDY0xOSHlqaHBhZzM5c2JEOQ?hl=en-IN&gl=IN&ceid=IN%3Aen",
    "title": "Google News",
    "chunk": "Google News",
    "chunk_id": "https://news.google.com/read/CBMisAFBVV95cUxPOC1lc29vaEt2cV9YVVFTOUFia0RXU21Rck5qblNaZThaOWpKNjhSUnJHbi1fTDNkUndNei11YzhlWDlkTkppT3Y4c0xtckZjTU4tMGhQUGFGdFVfUGlwNEZwTFNiYWxKZ0hZT2E4ZGJhZlNBUlNVUzhQZW1lWjM4cmtZYTJyYUtHTlE5ZV9IdXhGbzhXUFJRa1JTeEttWENDY0xOSHlqaHBhZzM5c2JEOQ?hl=en-IN&gl=IN&ceid=IN%3Aen_0",
    "timestamp": "2025-05-22T00:56:03.726773"
  },
  {
    "url": "https://www.ndtv.com/india-news/sbi-staff-in-wont-speak-kannada-video-transferred-siddaramiah-slams-her-8468909",
    "title": "Kannada, Siddaramaiah, State Bank of India: SBI Staff In 'Won't Speak Kannada' Video Transferred. Siddaramaiah Slams Her",
    "chunk": "Kannada, Siddaramaiah, State Bank of India: SBI Staff In 'Won't Speak Kannada' Video Transferred. Siddaramaiah Slams Her arrow-down comments printer search bell top-nav right-arrow NDTV World Profit हिंदी MOVIES IPL 2025 FOOD LIFESTYLE HEALTH TECH Games Big Bonus SHOPPING APPS Rajasthan MPCG Marathi Advertisement Live TV Latest India India All India News India Global Diaspora South Latest Will IndiGo Curb Deal With Turkish Airlines After Op Sindoor? What CEO Said 'Near-Death Experience': Trinamool MPs' Team On IndiGo Plane Caught In Storm J&K Lt Governor Announces Government Job For Family Of Shelling Victims Chennai Cop Dies By Suicide Ahead Of Drunk Driving Inquiry Meitei Group Calls 48-Hr Strike Over 'Manipur' Signage Removal World Videos Opinion Cities Metros Bengaluru Chennai Delhi Mumbai Other Cities Ahmedabad Allahabad Amritsar Bhopal Bhubaneshwar Chandigarh Ghaziabad Goa Gurgaon Guwahati Hyderabad Jaipur Kanpur Kolkata Lucknow Noida Patna Pune Srinagar Thiruvananthapuram Auto Web Stories Education Education Exams School Campus Study Abroad Web Stories Latest Planning To Study In UK? Here's How To Apply For Right Visa Kerala Class 12 Result 2025 To Be Declared On May 22 At This Time Rajasthan Board Class 12 Result To Be Out On May 22 At 3pm, Check Details After Student Complaints, HPBOSE To Recheck Class 12 English Answer Sheets Maharashtra Class 11 Admission Registration Begins For 20 Lakh Seats Podcast Auto Lifestyle Entertainment Offbeat Web Stories Science Trends Photos Feature People TV Schedule India@AI Login Switch To Dark/Light Mode Trending Tags Latest News World News PNR Status Education News Business News Sports News MP Chhattisgarh News Rajasthan News",
    "chunk_id": "https://www.ndtv.com/india-news/sbi-staff-in-wont-speak-kannada-video-transferred-siddaramiah-slams-her-8468909_0",
    "timestamp": "2025-05-22T00:56:19.444775"
  },
  {
    "url": "https://www.ndtv.com/india-news/sbi-staff-in-wont-speak-kannada-video-transferred-siddaramiah-slams-her-8468909",
    "title": "Kannada, Siddaramaiah, State Bank of India: SBI Staff In 'Won't Speak Kannada' Video Transferred. Siddaramaiah Slams Her",
    "chunk": "Seats Podcast Auto Lifestyle Entertainment Offbeat Web Stories Science Trends Photos Feature People TV Schedule India@AI Login Switch To Dark/Light Mode Trending Tags Latest News World News PNR Status Education News Business News Sports News MP Chhattisgarh News Rajasthan News Latest Mobile Phones Trending Committed To Closer Ties With India, Says Justin Trudeau Amid Row In Avoiding Repeat Of Telangana, BJP Pays Price In Tamil Nadu Man Complains Of Stomach Pain For Years, Doctors Find This Inside His Body \"They Can Speak For...\": US On India's Response On Canada's Allegations \"All Bank Employees Must...\": Siddaramaiah On 'Won't Speak Kannada' Video facebook twitter WhatsApp comments Settings Change Font Size A A Focus on Story Edition INDIA World Search here Get App for Better Experience Get it on Google Play Download on the App Store choose your destination Hindi Marathi MPCG Rajasthan News Updates Live TV India Latest Video Podcast Profit Movies News Updates Cricket Cities Notifications Opinion Web Stories Trends Featured Feature Offbeat Science People South Education Tech Food Sports Health Lifestyle Photos TV Schedule Big Bonus Toolbox Follow Us On Facebook Twitter Instagram LinkedIn YouTube search olympic crypto_icon News India News \"All Bank Employees Must...\": Siddaramaiah On 'Won't Speak Kannada' Video \"All Bank Employees Must...\": Siddaramaiah On 'Won't Speak Kannada' Video The SBI official's transfer follows the circulation of a viral video in which she is seen refusing to speak in Kannada as a customer insists. Edited by: Saikat Kumar Bose India News May 21, 2025 14:12 pm IST Published On May 21, 2025 12:53 pm",
    "chunk_id": "https://www.ndtv.com/india-news/sbi-staff-in-wont-speak-kannada-video-transferred-siddaramiah-slams-her-8468909_1",
    "timestamp": "2025-05-22T00:56:25.681556"
  },
  {
    "url": "https://www.ndtv.com/india-news/sbi-staff-in-wont-speak-kannada-video-transferred-siddaramiah-slams-her-8468909",
    "title": "Kannada, Siddaramaiah, State Bank of India: SBI Staff In 'Won't Speak Kannada' Video Transferred. Siddaramaiah Slams Her",
    "chunk": "the circulation of a viral video in which she is seen refusing to speak in Kannada as a customer insists. Edited by: Saikat Kumar Bose India News May 21, 2025 14:12 pm IST Published On May 21, 2025 12:53 pm IST Last Updated On May 21, 2025 14:12 pm IST Read Time: 3 mins Share Twitter WhatsApp Facebook Reddit Email Karnataka CM Siddaramiah has said all bank employees in Karnataka must try to speak Kannada The Bengaluru-based State Bank of India (SBI) official, who was seen refusing to speak Kannada in a viral video, has been transferred, Karnataka Chief Minister Siddaramaiah said. The Chief Minister said the behaviour of the SBI branch manager at Surya Nagara was \"strongly condemnable\" and stressed that \"respecting local language is respecting the people\". In a post on X, Mr Siddaramiah said, \"The behaviour of the SBI Branch Manager in Surya Nagara, Anekal Taluk, refusing to speak in Kannada & English and showing disregard to citizens, is strongly condemnable. We appreciate SBI's swift action in transferring the official. The matter may now be treated as closed.\" The behaviour of the SBI Branch Manager in Surya Nagara, Anekal Taluk refusing to speak in Kannada & English and showing disregard to citizens, is strongly condemnable. We appreciate SBI's swift action in transferring the official. The matter may now be treated as closed.… — Siddaramaiah (@siddaramaiah) May 21, 2025 The Chief Minister, known to back pro-Kannada organisations, said all bank employees in Karnataka must try to speak in Kannada. \"However, such incidents must not",
    "chunk_id": "https://www.ndtv.com/india-news/sbi-staff-in-wont-speak-kannada-video-transferred-siddaramiah-slams-her-8468909_2",
    "timestamp": "2025-05-22T00:56:31.553758"
  },
  {
    "url": "https://www.ndtv.com/india-news/sbi-staff-in-wont-speak-kannada-video-transferred-siddaramiah-slams-her-8468909",
    "title": "Kannada, Siddaramaiah, State Bank of India: SBI Staff In 'Won't Speak Kannada' Video Transferred. Siddaramaiah Slams Her",
    "chunk": "official. The matter may now be treated as closed.… — Siddaramaiah (@siddaramaiah) May 21, 2025 The Chief Minister, known to back pro-Kannada organisations, said all bank employees in Karnataka must try to speak in Kannada. \"However, such incidents must not recur. All bank employees must treat customers with dignity and make every effort to speak in the local language. I urge the @FinMinIndia & Dept of Financial Services to mandate cultural and language sensitisation training for all bank staff across India. Respecting local language is respecting the people,\" he said. The SBI official's transfer follows the circulation of a viral video in which she is seen refusing to speak in Kannada as a customer insists. When the customer says, \"this is Karnataka\", she replies, \"You have not given me employment\". When the customer repeats, \"This is Karnataka\", she hits back, \"This is India.\" She also says she won't \"speak Kannada for you\" and that she will \"speak Hindi. The man recording the exchange said the SBI branch should be \"taught a lesson\". The viral video and the action against the bank official have put the Kannada language row under the spotlight yet again. While pro-Kannada organisations argue that migrants working and living in Karnataka must learn the local language, others stress that no one should be forced to speak a language. The language row has often led to heated arguments in public, videos of which have gone viral and further stoked the debate. The SBI official's remarks also drew sharp criticism from Tejasvi Surya, BJP MP",
    "chunk_id": "https://www.ndtv.com/india-news/sbi-staff-in-wont-speak-kannada-video-transferred-siddaramiah-slams-her-8468909_3",
    "timestamp": "2025-05-22T00:56:36.898891"
  },
  {
    "url": "https://www.ndtv.com/india-news/sbi-staff-in-wont-speak-kannada-video-transferred-siddaramiah-slams-her-8468909",
    "title": "Kannada, Siddaramaiah, State Bank of India: SBI Staff In 'Won't Speak Kannada' Video Transferred. Siddaramaiah Slams Her",
    "chunk": "forced to speak a language. The language row has often led to heated arguments in public, videos of which have gone viral and further stoked the debate. The SBI official's remarks also drew sharp criticism from Tejasvi Surya, BJP MP from Bengaluru South. \"This behaviour by @TheOfficialSBI Branch Manager is simply not acceptable. If you are doing customer interface work in Karnataka, especially in a sector like banking, it is important to communicate to customers in the language they know. Being adamant like this is simply not right,\" he said. \"I have time and again raised this issue of mandatorily posting local staff or staff who know the local language in banking operations, both inside and outside Parliament. Just a few weeks ago, at a Public Accounts Committee meeting, I had raised this issue to the DFS Secretary who assured me action will be taken to follow a office notification that makes this requirement of local language knowledge compulsory. Looks like this still isn't being enforced properly. I urge the concerned at @TheOfficialSBI to immediately implement the DFS policy that mandates local language requirement,\" he added. \"I have spoken to concerned authorities to take action against this manager who has behaved in this manner. Banks working in Karnataka should serve customers in Kannada. Period,\" he said. Show full article Track Latest News Live on NDTV.com and get news updates from India and around the world Follow us: State Bank Of India , Kannada Row , Siddaramaiah Related News \"Learning 200 Words Is Difficult?\" Mohandas Pai Slams",
    "chunk_id": "https://www.ndtv.com/india-news/sbi-staff-in-wont-speak-kannada-video-transferred-siddaramiah-slams-her-8468909_4",
    "timestamp": "2025-05-22T00:56:42.082765"
  },
  {
    "url": "https://www.ndtv.com/india-news/sbi-staff-in-wont-speak-kannada-video-transferred-siddaramiah-slams-her-8468909",
    "title": "Kannada, Siddaramaiah, State Bank of India: SBI Staff In 'Won't Speak Kannada' Video Transferred. Siddaramaiah Slams Her",
    "chunk": "Show full article Track Latest News Live on NDTV.com and get news updates from India and around the world Follow us: State Bank Of India , Kannada Row , Siddaramaiah Related News \"Learning 200 Words Is Difficult?\" Mohandas Pai Slams SBI Manager For Refusing To Speak In Kannada To SBI Manager's \"This Is India\" Remark, Customer's \"Kannada First\" Reply \"I Also Get Threat Calls, We Can't Help It\": Karnataka Chief Minister Siddaramaiah Trending News Video: Passengers Scream As IndiGo Flight Hit By Turbulence, Aircraft Damaged Sufism, Seduction, And Pak ISI: The Double Life Of Diplomat Madhuri Gupta Cannes 2025: Ishaan, Janhvi's Homebound Gets A Nine-Minute Standing Ovation As Trump Reveals 'Golden Dome', A Look At India's Shield, Israel's Iron Dome Will IndiGo Curb Deal With Turkish Airlines After Op Sindoor? What CEO Said Advertisement Advertisement Advertisement Quick Links Latest News PNR Status Education News Business News Sports News MP Chhattisgarh News NDTV Profit Auto News AI News Sofiya Qureshi Remark Mumbai Rain Jyoti Malhotra Amit Malviya Kannada Language Row Operation Sindoor Maharashtra Covid Cases MI vs DC Advertisement Edition INDIA World Search for News, Photos and Videos Get App for Better Experience Get it on Google Play Download on the App Store Get App for Better Experience Install Now choose your destination Hindi Marathi MPCG Rajasthan News Updates Live TV India Latest Video Podcast Profit Movies Cricket Cities Featured Notifications Opinion Web Stories Trends Feature More Links Offbeat Science People South Education Tech Food Sports Health Lifestyle Photos TV Schedule Big Bonus Toolbox Follow Us On",
    "chunk_id": "https://www.ndtv.com/india-news/sbi-staff-in-wont-speak-kannada-video-transferred-siddaramiah-slams-her-8468909_5",
    "timestamp": "2025-05-22T00:56:47.504770"
  },
  {
    "url": "https://www.ndtv.com/india-news/sbi-staff-in-wont-speak-kannada-video-transferred-siddaramiah-slams-her-8468909",
    "title": "Kannada, Siddaramaiah, State Bank of India: SBI Staff In 'Won't Speak Kannada' Video Transferred. Siddaramaiah Slams Her",
    "chunk": "News Updates Live TV India Latest Video Podcast Profit Movies Cricket Cities Featured Notifications Opinion Web Stories Trends Feature More Links Offbeat Science People South Education Tech Food Sports Health Lifestyle Photos TV Schedule Big Bonus Toolbox Follow Us On Facebook Twitter Instagram Linkedin Youtube Whatsapp Threads Snapchat arrow-down search search olympic crypto_icon arrow-rgt arrow-next arrow-up close reddit-fill facebook-fill whatsapp-fill cog left-arrow snapchat-fill astrology-icn Listen to the latest songs , only on JioSaavn.com",
    "chunk_id": "https://www.ndtv.com/india-news/sbi-staff-in-wont-speak-kannada-video-transferred-siddaramiah-slams-her-8468909_6",
    "timestamp": "2025-05-22T00:56:50.735576"
  },
  {
    "url": "https://news.google.com/home?hl=en-IN&gl=IN&ceid=IN:en",
    "title": "Google News",
    "chunk": "Google News News Advanced search Help Help Privacy Terms About Google Get the Android app Get the iOS app Send feedback Settings Settings Language & region English (India) Sign in Home For you Following News Showcase India World Local Business Technology Entertainment Sports Science Health More News Your briefing Today 38° 27° Fri 38° 29° Sat 36° 28° Sun 36° 28° Delhi 34°C Google Weather Top stories Two Israeli embassy staff members shot dead near Jewish museum in Washington Times of India 2 hours ago More Two Israeli Embassy staffers killed in shooting near Jewish Museum in Washington DC The Indian Express 2 hours ago More Who is Elias Rodriguez? Suspect arrested for killing two Israeli embassy staffers in Washington Times of India 14 minutes ago More DC shooting: Victims were a young couple, he purchased ‘ring’ to propose next week in Jerusalem By Shweta Kukreti Hindustan Times 48 minutes ago More Full coverage Who was Nambala Keshav Rao aka Basavaraju, top Maoist leader killed in Bastar Op Hindustan Times 16 hours ago More Basavaraju was trained by LTTE in jungle warfare, military tactics and IED use By Sumit Bhattacharjee The Hindu 12 hours ago More ‘Warzone’: Why Indian forces have launched a deadly assault on Maoists By Alok Putul Al Jazeera 2 hours ago More Chhattisgarh encounter: Death of Maoist top leader Nambala Keshav Rao deals major blow to Naxalism By SNV Sudhir Deccan Herald 16 hours ago More Full coverage Canada eyes investment in Golden Dome Defence shield: PM Carney By Garvit Bhirani Mint",
    "chunk_id": "https://news.google.com/home?hl=en-IN&gl=IN&ceid=IN:en_0",
    "timestamp": "2025-05-22T11:39:50.494414"
  },
  {
    "url": "https://news.google.com/home?hl=en-IN&gl=IN&ceid=IN:en",
    "title": "Google News",
    "chunk": "Chhattisgarh encounter: Death of Maoist top leader Nambala Keshav Rao deals major blow to Naxalism By SNV Sudhir Deccan Herald 16 hours ago More Full coverage Canada eyes investment in Golden Dome Defence shield: PM Carney By Garvit Bhirani Mint 5 hours ago More India-Pakistan tensions rise as Islamabad expels Indian Diplomat after spy row financialexpress.com 3 hours ago More Local news Manage local news Picks for you Sign in for personalised stories in your briefing and news feed Sign in Search Clear search Close search Google apps Main menu",
    "chunk_id": "https://news.google.com/home?hl=en-IN&gl=IN&ceid=IN:en_1",
    "timestamp": "2025-05-22T11:39:53.401953"
  }
]